SpellsToLearn = { 
    MAGE = { -- 职业通用名称（即英文名称的大写版）
        [1] = {
            {"奥术智慧", 1, function() return true; end}, -- {技能名称, 技能等级[, 过滤函数(即只有该函数返回true是才认为该技能为可学习技能，可空)]}
        },
        [4] = {
            {"造水术",1},
            {"寒冰箭",1},
        },
        [6] = {
            {"造食术", 1},
            {"火球术", 2},
            {"火焰冲击", 1},
        },
        [8] = {
            {"奥术飞弹", 1},
            {"变形术", 1},
            {"寒冰箭", 2},
        },
        [10] = {
            {"造水术", 2},
            {"霜甲术", 2},
            {"冰霜新星", 1},
        },
        [12] = {
            {"造食术", 2},
            {"魔法抑制", 1},
            {"火球术", 3},
        },
        [14] = {
            {"魔爆术", 1},
            {"奥术智慧", 2},
            {"火焰冲击", 2},
            {"寒冰箭", 3},
        },
        [16] = {
            {"奥术飞弹", 2},
        },
        [18] = {
            {"解除次级诅咒",},
            {"火球术", 4},
        },
        [20] = {
            {"Blink", },
            {"Conjure Water", 3},
            {"Evocation",},
            {"Polymorph", 2},
            {"Blizzard", 1},
            {"Frost Armor", 3},
            {"Frostbolt", 4},
        },
        [22] = {
            {"Arcane Explosion", 2},
            {"Conjure Food", 3},
            {"Fire Blast", 3},
        },
        [24] = {
            {"Arcane Missiles", 3},
            {"Counterspell",},
            {"Dampen Magic", 2},
            {"Fireball", 5},
            {"Pyroblast", 2, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
        },
        [26] = {
            {"Frostbolt", 5},
        },
        [28] = {
            {"Arcane Intellect", 3},
            {"Blizzard", 2},
        },
        [30] = {
            {"Arcane Explosion", 3},
            {"Conjure Water", 4},
            {"Fire Blast", 4},
            {"Fireball", 6},
            {"Pyroblast", 3, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
            {"Ice Armor", 1},
        },
        [32] = {
            {"Arcane Missiles", 4},
            {"Conjure Food", 4},
            {"Frostbolt", 6},
        },
        [34] = {
            {"Mage Armor", 1},
        },
        [36] = {
            {"Dampen Magic", 3},
            {"Fireball", 7},
            {"Pyroblast", 4, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
            {"Blizzard", 3},
        },
        [38] = {
            {"Arcane Explosion", 4},
            {"Fire Blast", 5},
            {"Frostbolt", 7},
        },
        [40] = {
            {"Arcane Missiles", 5},
            {"Conjure Water", 5},
            {"Polymorph", 3},
            {"Ice Armor", 2},
        },
        [42] = {
            {"Arcane Intellect", 4},
            {"Conjure Food", 5},
            {"Fireball", 8},
            {"Pyroblast", 5, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
        },
        [44] = {
            {"Blizzard", 4},
            {"Frostbolt", 8},
        },
        [46] = {
            {"Arcane Explosion", 5},
            {"Mage Armor", 2},
            {"Fire Blast", 6},
            {"Ice Barrier", 2, function()
                local _, _, _, _, currentRank = GetTalentInfo(3,17);
                return currentRank == 1;            
                end
            },
        },
        [48] = {
            {"Arcane Missiles", 6},
            {"Dampen Magic", 4},
            {"Fireball", 9},
            {"Pyroblast", 6, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
        },
        [50] = {
            {"Conjure Water", 6},
            {"Frostbolt", 9},
            {"Ice Armor", 3},
        },
        [52] = {
            {"Conjure Food", 6},
            {"Blizzard", 5},
            {"Ice Barrier", 3, function()
                local _, _, _, _, currentRank = GetTalentInfo(3,17);
                return currentRank == 1;            
                end
            },
        },
        [54] = {
            {"Arcane Explosion", 6},
            {"Fireball", 10},
            {"Pyroblast", 7, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
            {"Fire Blast", 7},
        },
        [56] = {
            {"Arcane Intellect", 5},
            {"Arcane Missiles", 7},
            {"Frostbolt", 10},
        },
        [58] = {
            {"Mage Armor", 3},
            {"Ice Barrier", 4, function()
                local _, _, _, _, currentRank = GetTalentInfo(3,17);
                return currentRank == 1;            
                end
            },
        },
        [60] = {
            {"Dampen Magic", 5},
            {"Polymorph", 4},
            {"Fireball", 11},
            {"Pyroblast", 8, function()
                local _, _, _, _, currentRank = GetTalentInfo(2,8);
                return currentRank == 1;            
                end
            },
            {"Blizzard", 6},
            {"Ice Armor", 4},
        },    
    },
    PRIEST = { -- 职业通用名称（即英文名称的大写版）
        [1] = {
            {"真言术：韧", 1}, -- {技能名称, 技能等级[, 过滤函数(即只有该函数返回true是才认为该技能为可学习技能，可空)]}
        },
        [4] = {
            {"暗言术：痛", 1},
            {"次级治疗术", 2},
        },
        [6] = {
            {"真言术：盾", 1},
            {"惩击", 2},
        },
        [8] = {
            {"恢复", 1},
        },
        [10] = {
            {"心灵震爆", 1},
            {"暗言术：痛", 2},
            {"复活术", 1},
            {"次级治疗术", 3},
        },
        [12] = {
            {"真言术：盾", 2},
            {"真言术：韧", 2},
            {"心灵之火", 1},
        },
        [14] = {
            {"恢复", 2},
            {"惩击", 3},
        },
        [16] = {
            {"心灵震爆", 2},
            {"治疗术", 1},
        },
        [18] = {
            {"真言术：盾", 3},
            {"驱散魔法", 1},
            {"暗言术：痛", 3},
        },
        [20] = {
            {"快速治疗", 1},
            {"恢复", 3},
            {"心灵之火", 2},
        },
        [22] = {
            {"心灵震爆", 3},
            {"复活术", 2},
            {"惩击", 4},
            {"治疗术", 2},
        },
        [24] = {
            {"真言术：盾", 4},
            {"真言术：韧", 3},
        },
        [26] = {
            {"暗言术：痛", 4},
            {"快速治疗", 2},
            {"恢复", 4},
        },
        [28] = {
            {"心灵震爆", 4},
            {"治疗术", 3},
        },
        [30] = {
            {"真言术：盾", 5},
            {"心灵之火", 3},
            {"防护暗影", 1},
            {"惩击", 5},
            {"神圣之火", 3},
        },
        [32] = {
            {"快速治疗", 3},
            {"恢复", 5},
            {"驱除疾病"},
        },
        [34] = {
            {"心灵震爆", 5},
            {"暗言术：痛", 5},
            {"治疗术", 4},
        },
        [36] = {
            {"真言术：盾", 6},
            {"真言术：韧", 4},
            {"驱散魔法", 2},
            {"神圣之火", 4},
        },
        [38] = {
            {"快速治疗", 4},
            {"恢复", 6},
            {"惩击", 6},
        },
        [40] = {
            {"神圣之灵", 2},
            {"心灵之火", 4},
            {"心灵震爆", 6},
        },
        [42] = {
            {"真言术：盾", 7},
            {"暗言术：痛", 6},
            {"防护暗影", 2},
            {"神圣之火", 5},
        },
        [44] = {
            {"快速治疗", 5},
            {"恢复", 7},
        },
        [46] = {
            {"心灵震爆", 7},
            {"惩击", 7},
        },
        [48] = {
            {"真言术：盾", 8},
            {"真言术：韧", 5},
            {"神圣之火", 6},
        },
        [50] = {
            {"心灵之火", 5},
            {"神圣之灵", 3},
            {"暗言术：痛", 7},
            {"快速治疗", 6},
            {"恢复", 8},
        },
        [52] = {
            {"心灵震爆", 8},
        },
        [54] = {
            {"真言术：盾", 9},
            {"惩击", 8},
            {"神圣之火", 7},
        },
        [56] = {
            {"防护暗影", 3},
            {"快速治疗", 7},
            {"恢复", 9},
        },
        [58] = {
            {"心灵震爆", 9},
            {"暗言术：痛", 8},
        },
        [60] = {
            {"真言术：盾", 10},
            {"真言术：韧", 6},
            {"神圣之灵", 4},
            {"心灵之火", 6},
            {"神圣之火", 8},
        },
    },
    WARRIOR = {
        [1] = {
            {"战斗怒吼", 1},
        },
        [4] = {
            {"冲锋", 1},
            {"撕裂", 1},
        },
        [6] = {
            {"雷霆一击", 1},
            {"招架"},
        },
        [8] = {
            {"断筋", 1},
            {"英勇打击", 2},
        },
        [10] = {
            {"双武器"},
            {"撕裂", 2},
        },
        [12] = {
            {"破甲攻击", 1},
            {"战斗怒吼", 2},
        },
        [14] = {
            {"挫志怒吼", 1},
        },
        [16] = {
            {"英勇打击", 3},
            {"惩戒痛击", 1},
        },
        [18] = {
            {"雷霆一击", 2},
        },
        [20] = {
            {"撕裂", 3},
            {"顺劈斩", 1},
            {"复仇"},
        },
        [22] = {
            {"战斗怒吼", 3},
        },
        [24] = {
            {"斩杀"},
            {"英勇打击", 4},
        },
        [26] = {
            {"冲锋", 2},
            {"惩戒痛击", 2},
        },
        [28] = {
            {"雷霆一击", 3},
        },
        [30] = {
            {"撕裂", 3},
        },
        [32] = {
            {"断筋", 2},
            {"英勇打击", 5},
        },
        [36] = {
            {"惩戒痛击", 3},
        },
        [38] = {
            {"雷霆一击", 4},
        },
        [40] = {
            {"英勇打击", 6},
            {"撕裂", 5},
        },
        [46] = {
            {"冲锋", 3},
            {"惩戒痛击", 4},
        },
        [48] = {
            {"英勇打击", 7},
            {"雷霆一击", 5},
        },
        [50] = {
            {"撕裂", 6},
        },
        [54] = {
            {"断筋", 3},
        },
        [56] = {
            {"英勇打击", 8},
            {"惩戒痛击", 5},
        },
        [58] = {
            {"雷霆一击", 6},
        },
        [60] = {
            {"撕裂", 7},
        },
    },
    ROGUE = {
        [1] = {
            {"潜行", 1},
        },
        [4] = {
            {"背刺", 1},
        },
        [6] = {
            {"邪恶攻击", 2},
        },
        [8] = {
            {"剔骨", 2},
            {"闪避"},
        },
        [10] = {
            {"双武器"},
        },
        [12] = {
            {"背刺", 2},
            {"脚踢", 1},
            {"招架"},
        },
        [14] = {
            {"邪恶攻击", 3},
        },
        [16] = {
            {"剔骨", 3},
        },
        [20] = {
            {"割裂", 1},
            {"背刺", 3},
        },
        [22] = {
            {"邪恶攻击", 4},
        },
        [24] = {
            {"剔骨", 4},
        },
        [26] = {
            {"偷袭"},
            {"脚踢", 2},
        },
        [28] = {
            {"割裂", 2},
            {"背刺", 4},
        },
        [30] = {
            {"邪恶攻击", 5},
        },
        [32] = {
            {"剔骨", 5},
        },
        [36] = {
            {"割裂", 3},
            {"背刺", 5},
        },
        [38] = {
            {"邪恶攻击", 6},
        },
        [40] = {
            {"剔骨", 6},
            {"背刺", 6},
        },
        [42] = {
            {"脚踢", 3},
        },
        [44] = {
            {"割裂", 4},
        },
        [46] = {
            {"邪恶攻击", 7},
        },
        [48] = {
            {"剔骨", 7},
        },
        [52] = {
            {"割裂", 5},
            {"背刺", 7},
        },
        [54] = {
            {"邪恶攻击", 8},
        },
        [56] = {
            {"剔骨", 8},
        },
        [58] = {
            {"脚踢", 4},
        },
        [60] = {
            {"割裂", 6},
            {"背刺", 8},
        },
    },
    HUNTER = {
        [4] = {
            {"毒蛇钉刺", 1},
        },
        [6] = {
            {"奥术射击", 1},
            {"猎人印记", 1}
        },
        [8] = {
            {"震荡射击"},
            {"猛禽一击", 2},
        },
        [10] = {
            {"毒蛇钉刺", 2},
            {"雄鹰守护", 1},
            {"治疗宠物", 1},
        },
        [12] = {
            {"奥术射击", 2},
        },
        [16] = {
            {"猛禽一击", 3},
            {"猫鼬撕咬", 1},
        },
        [18] = {
            {"毒蛇钉刺", 3},
            {"雄鹰守护", 2},
        },
        [20] = {
            {"治疗宠物", 2},
        },
        [22] = {
            {"猎人印记", 2},
        },
        [24] = {
            {"猛禽一击", 4},
        },
        [26] = {
            {"急速射击"},
            {"毒蛇钉刺", 4},
        },
        [28] = {
            {"奥术射击", 4},
            {"瞄准射击", 2, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 5);
                    return currentRank == 1;            
                end},
            {"治疗宠物", 3},
            {"雄鹰守护", 3},
        },
        [30] = {
            {"假死"},
            {"猫鼬撕咬", 2},
        },
        [32] = {
            {"猛禽一击", 5},
        },
        [34] = {
            {"毒蛇钉刺", 5},
        },
        [36] = {
            {"奥术射击", 5},
            {"瞄准射击", 3, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 5);
                    return currentRank == 1;            
                end},
            {"治疗宠物", 4},
        },
        [40] = {
            {"猎人印记", 3},
            {"猛禽一击", 6},
        },
        [42] = {
            {"毒蛇钉刺", 6},
        },
        [44] = {
            {"奥术射击", 6},
            {"瞄准射击", 4, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 5);
                    return currentRank == 1;            
                end},
            {"猫鼬撕咬", 3},
            {"治疗宠物", 5},
        },
        [48] = {
            {"雄鹰守护", 5},
        },
        [50] = {
            {"强击光环", 2, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 14);
                    return currentRank == 1;            
                end},
            {"毒蛇钉刺", 7},
        },
        [52] = {
            {"奥术射击", 7},
            {"瞄准射击", 5, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 5);
                    return currentRank == 1;            
                end},
            {"治疗宠物", 6},
        },
        [56] = {
            {"猛禽一击", 8},
        },
        [58] = {
            {"毒蛇钉刺", 8},
            {"猎人印记", 4},
            {"猫鼬撕咬", 4},
            {"雄鹰守护", 6},
        },
        [60] = {
            {"奥术射击", 8},
            {"瞄准射击", 6, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 5);
                    return currentRank == 1;            
                end            },
            {"强击光环", 3, function()
                    local _, _, _, _, currentRank = GetTalentInfo(2, 14);
                    return currentRank == 1;            
                end},
            {"治疗宠物", 7},
        },
    },
};
--------------------------------------------------------------------------------
